In [3]:
import sqlite3
import pandas as pd

db = sqlite3.connect('School.sqlite')

In [4]:
data = pd.read_sql_query("select *from student", db)
data

   RollNumber     Name  Age
0         101     Aman   30
1         102     Amit   20
2         103    Mohit   50
3         104   Nikhil   30
4         105    Nidhi   30
5         106  Manisha   30
6         107   Ankush   30

In [5]:
data['Age'] == 30

0     True
1    False
2    False
3     True
4     True
5     True
6     True
Name: Age, dtype: bool

In [6]:
data[data['Age'] == 30]

   RollNumber     Name  Age
0         101     Aman   30
3         104   Nikhil   30
4         105    Nidhi   30
5         106  Manisha   30
6         107   Ankush   30

In [7]:
data = pd.DataFrame([[201,"Aman", "English", 20000],[202,"komal","Maths",22000], [203,"Mahesh", "Science",23000]], columns = ["ID","Name","Course","Salary"])
data

    ID    Name   Course  Salary
0  201    Aman  English   20000
1  202   komal    Maths   22000
2  203  Mahesh  Science   23000

In [8]:
data.to_sql("Faculty", db)

3

In [9]:
data = pd.read_sql_query("select *from student", db)
data["Address"] = "Test"
data

   RollNumber     Name  Age Address
0         101     Aman   30    Test
1         102     Amit   20    Test
2         103    Mohit   50    Test
3         104   Nikhil   30    Test
4         105    Nidhi   30    Test
5         106  Manisha   30    Test
6         107   Ankush   30    Test

In [10]:
data.to_sql("student", db, if_exists = "replace")

7